package vagapov.core.block_5;

/**
 * Массивы в Java имеют фиксированную длину. Попробуем обойти это ограничение.
 * Сделайте класс DynamicArray так, чтобы он хранил в себе массив,
 * и имел методы для добавления void add(T el), void remove(int index) удаления и извлечения T get(int index) из него элементов,
 * при переполнении текущего массива, должен создаваться новый, большего размера.
 *
 * Для возможности работы с различными классами DynamicArray должен быть дженериком.
 * Для решения задачи можно воспользоваться методами из класса java.util.Arrays.
 * Импорт этого класса уже объявлен в тестирующей системе. Добавлять его явно не нужно
 *
 * Требования:
 * 1. класс DynamicArray должен иметь методы публичные void add(T el), void remove(int index) и T get(int index) и геттер на поле
 * 2. В случае подбора некорректного индекса ожидается, что метод get выбросит ArrayIndexOutOfBoundsException
 * 3. класс DynamicArray должен иметь публичный конструктор по умолчанию
 * 4. работа методов должна соответствовать условию
 */
public class DynamicArray {
}
